Repository: 84000/data-translation-memory
Catalog: toh64-v3.tmx
Source language: bo
Languages: en

source: ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པར་བྱའོ། །
en: They should remain absorbed in meditation.

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ལ་སོ་སོར་བརྟག་པར་བྱའོ། །
en: They should examine in detail the nature of all dharmas as they really are.

source: གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་དྲུག་པོ་འདི་དག་ཡོངས་སུ་རྫོགས་པར་གྱུར་ན་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: “Vidyutprāpta, if bodhisattvas complete these six things, they will quickly become perfectly and completely enlightened in unsurpassed, true, perfect enlightenment.

source: ཇི་ལྟར་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅེ་ན།
en: How can they completely perfect it?

source: འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་བརྟེན་ནས་མངོན་པར་སྒྲུབ་པར་བྱེད་པའི་ཕྱིར་རོ། །
en: Like this: by relying on omniscient, exalted wisdom and fully accomplishing it.

source: གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཀྱི་གཏེར་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Vidyutprāpta, what is the bodhisattvas’ treasure of the Dharma?

source: བྱང་ཆུབ་སེམས་དཔས་གཟུགས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་རྟོགས་ཤིང་། གཟོད་མ་ཉིད་ནས་སྐྱེ་བ་མེད་པ་དང་། རང་བཞིན་གྱིས་རྣམ་པར་དག་པར་མཐོང་བ་གང་ཡིན་པའོ། །
en: Bodhisattvas are those who are totally aware of all matter as it really is and see that, from the very beginning, it is not produced and is pure by nature.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་གཟུགས་ལ་མཁས་པ་ཐོབ་པའི་ཕྱིར་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་ལྡན་པར་འགྱུར་རོ། །
en: Because the bodhisattvas have acquired skill regarding matter, they possess four analytical knowledges.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the four?

source: དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པའོ། །
en: They are the analytical knowledge of meaning, the analytical knowledge of dharmas, the analytical knowledge of language, and the analytical knowledge of eloquence.

source: དེ་ལ་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ནི་གཟུགས་ཀྱི་དོན་རྣམས་ལ་ཐོགས་པ་མེད་པར་གྱུར་པའི་ཕྱིར་རོ། །
en: “Here, the analytical knowledge of meaning is the meaning of matter, because it is without obscuration.

source: གཟུགས་ཀྱི་དོན་གང་ཞེ་ན།
en: What is the meaning of matter?

source: འདི་ལྟ་སྟེ། དོན་དམ་པ་གང་ཡིན་པའོ། །
en: It is the ultimate truth of meaning.

source: དོན་དམ་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What is ultimate truth?

source: གཟུགས་དམིགས་སུ་མེད་པ་གང་ཡིན་པ་སྟེ། དོན་དམ་པའི་ཡེ་ཤེས་འདི་ལྟ་བུ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ། །
en: It is the impossibility of apprehending matter, and being endowed with such knowledge of the ultimate truth is called analytical knowledge of meaning.

source: ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་ནི་གཟུགས་ཀྱི་ཆོས་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་བརྟགས་ནས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ། །
en: “As for the analytical knowledge of dharmas, the correct understanding of reality, after an analysis of objects of consciousness as they really are, is called analytical knowledge of dharmas.

source: ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་ནི་འདི་ལྟ་སྟེ། གཟུགས་རྣམས་ལ་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ཀྱི་ཐབས་ལ་མཁས་པས་ངེས་པའི་ཚིག་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་འབྱེད་པ་གང་ཡིན་པ་དེ་ནི་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ། །
en: “As for the analytical knowledge of language, the discrimination through various types of grammatical analysis by skillful means in the unobstructed knowledge of objects of consciousness is called analytical knowledge of language.

source: སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་ནི་འདི་ལྟ་སྟེ། གཟུགས་ཀྱི་ཆོས་རྣམས་སེམས་ཅན་གྱི་དབང་པོ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་ཕྱེ་སྟེ་སྟོན་པར་བྱེད་ཀྱང་ཀུན་ནས་ཉོན་མོངས་པ་མེད་ཅིང་མངོན་པར་ཞེན་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ། །
en: “As for the analytical knowledge of eloquence, differentiating and teaching about objects of consciousness according to the faculties of sentient beings while not being afflicted and not being attached is called analytical knowledge of eloquence.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་འདི་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་པས་གཟུགས་ཀྱི་ཆོས་ལ་རྨོངས་ཤིང་མངོན་པར་ཞེན་པར་གྱུར་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རང་བཞིན་དང་། འདུན་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྩོལ་བ་མེད་པའི་ཡེ་ཤེས་ཀྱིས་ཅི་རིགས་པར་ཆོས་སྟོན་པར་བྱེད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ལ་མཚན་ཉིད་གཉིས་སུ་གྱུར་པ་མེད་དེ།
en: Bodhisattvas, since they are endowed with this sort of knowledge, use their effortless knowledge to teach the Dharma appropriately, according to the faculties and desires of all sentient beings who are confused by and attached to objects of consciousness, even though in the dharmadhātu there is no duality of characteristics.

source: སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་ཀྱི་བར་ལ་ཡང་དེ་བཞིན་དུ་རྒྱས་པར་སྦྱར་ཏེ། །
en: This can be applied in the same way to sounds, smells, tastes, and objects of touch, up to mental objects.

source: གློག་ཐོབ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཆོས་ཀྱི་གཏེར་ཞེས་བྱའོ། །
en: “Vidyutprāpta, this is what is called the bodhisattva mahāsattvas’ treasure of the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་གཏེར་འདི་ཐོབ་པར་གྱུར་ན་སྤྱོད་ཡུལ་རྣམས་ལ་རྨོངས་པར་གྱུར་པའི་སེམས་ཅན་དེ་ལྟ་བུ་དག་ཡོངས་སུ་གདུལ་བར་འདོད་པའི་ཕྱིར་དེ་དག་གི་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེ་དག་རེ་རེ་ལ་ཡང་བསྐལ་པ་འམ། བསྐལ་པ་ལས་ལྷག་པར་ཚིག་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཐབས་ལ་མཁས་པས་ཆོས་སྟོན་པར་བྱེད་ཀྱང་དེ་དག་གི་མཐའ་ཡང་རྙེད་པར་མི་འགྱུར་ལ།
en: Bodhisattvas, if they obtain this treasure, because they wish to train those sorts of beings who are confused regarding objects, teach them the Dharma individually with their skill in various types of verbal expression for a kalpa or more than a kalpa.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཤེས་རབ་ལ་ཡང་འགྲིབ་པ་མེད་ཅིང་ཆོས་ཀྱི་དབྱིངས་དང་མི་འགལ་བར་གཉིས་སུ་མེད་ཅིང་དབྱེར་མེད་པའི་རྗེས་སུ་འབྲང་བ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པས་ཆོས་ཐམས་ཅད་དབྱེར་མེད་པའི་མཚན་ཉིད་བསྟན་པས་འཐོབ་པའི་ཆོས་ཀྱི་གཏེར་ཞེས་བྱའོ། །
en: Although the confusion of sentient beings is endless, the bodhisattvas’ wisdom is unimpaired, not in conflict with the dharmadhātu, and follows the nondual and the undifferentiated. This is called the treasure of the Dharma, which is obtained through the bodhisattvas’ teaching, by their skillful means, of the undifferentiated nature of all dharmas.

source: ཆོས་ཀྱི་གཏེར་འདིས་སེམས་ཅན་དག་ལ་ཅི་རིགས་པར་ཆོས་བསྟན་ནས་ཟད་མི་ཤེས་པའི་ཆོས་ཀྱི་གཏེར་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཏེ། འཁོར་བའི་རྒུད་པ་གཏན་དུ་སྤོང་བ་གང་ཡིན་པ་འདི་ནི་གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་གཏེར་ཆེན་པོ་དང་།
en: “By means of this treasure of the Dharma, they correctly teach the Dharma to sentient beings, and they become endowed with the inexhaustible Dharma treasure and abandon the misfortunes of saṃsāra forever.

source: ཟད་མི་ཤེས་པའི་གཏེར་དང་། ཀུན་ཏུ་ཟད་མི་ཤེས་པའི་གཏེར་དང་། མཐའ་མེད་པའི་གཏེར་རྣམ་པ་ལྔ་ཞེས་བྱའོ། །
en: “These, Vidyutprāpta, are the five types of the bodhisattvas’ great treasures, inexhaustible treasures, totally inexhaustible treasures, and unlimited treasures.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གཏེར་འདི་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ན་ཡོན་ཏན་ཁྱད་པར་དུ་འཕགས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཕྱིར་ཚེགས་ཆུང་ངུས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: If bodhisattvas possess these sorts of treasures, because they will have completely perfected the especially exalted virtues, they will quickly become perfectly and completely enlightened in unsurpassed, true, perfect enlightenment.”

source: ཆོས་ཀྱི་གཏེར་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྟན་པའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་གློག་ཐོབ་ནི་གཟུངས་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: After this Dharma discourse that teaches the treasure of the Dharma, the bodhisattva Vidyutprāpta obtained dhāraṇī.

source: བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་ནི་གློག་གི་འོད་ཟེར་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཏོ། །
en: Five hundred bodhisattvas obtained the lightning luster samādhi.

source: ལྷའི་བུ་སུམ་ཁྲི་དྲུག་སྟོང་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ། །
en: Thirty-six thousand devaputras produced the thought of unsurpassed, true, perfect enlightenment.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བའི་རྒྱལ་མཚན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ་རྩོལ་བ་མ་མཆིས་པའི་ཡེ་ཤེས་ཞེས་གང་གསུངས་པ་དེའི་དོན་ཇི་ལྟ་བུ་ལགས།
en: Then the bodhisattva Candradhvaja asked the Bhagavān, “What is the meaning of ‘wisdom without effort,’ which was mentioned by the Bhagavān?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་དགེ་བའི་ཆོས་རྣམས་ལ་ལུས་དང་སེམས་ཀྱི་རྗེས་སུ་འཐུན་པས་དམིགས་ཤིང་མངོན་པར་འདུ་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་རྩོལ་བ་དང་བཅས་པ་ཞེས་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་གང་ལུས་དང་སེམས་རབ་ཏུ་དུལ་བར་གྱུར་ནས། དྲན་པ་མེད་པ། གནས་པ་མེད་པ། རྣལ་འབྱོར་བསྒོམ་པའི་མཚན་མ་དང་བྲལ་བར་གྱུར་པ་དང་། དེ་སྔོན་གྱི་སྨོན་ལམ་དང་།
en: The Bhagavān replied, “What bodhisattvas, since they are in agreement in body and mind regarding good dharmas, do when they focus on something, is called with effort.

source: ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་གྱུར་པས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་སྟོང་ཕྲག་མང་པོ་རྣམས་སུ་རྣམ་པ་སྣ་ཚོགས་སུ་སྟོན་པར་བྱེད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ལས་གཡོ་བ་མེད་པ་དང་། རྟག་ཏུ་ཆོས་སྟོན་པར་བྱེད་ཀྱང་ཆོས་ཀྱི་མཚན་མ་ཅུང་ཟད་ཙམ་ཡང་མེད་པ་དང་། བསྡུ་བའི་དངོས་པོ་བཞིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་ཀྱང་སེམས་ཅན་གང་ཡང་ཡོངས་སུ་བཟླས་པ་མེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་སྦྱངས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དང་། རྟག་པར་སངས་རྒྱས་རྣམས་རྗེས་སུ་དྲན་པར་བྱེད་ཀྱང་གཟུགས་ཀྱི་མཚན་ཉིད་དུ་མི་ལྟ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་ཏུ་རྒྱུ་བར་བྱེད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་དང་མི་འབྲལ་བ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྩོལ་བ་མེད་པའི་ཡེ་ཤེས་ཤེས་བྱའོ། །
en: If there are bodhisattvas who, after subduing their body and mind, are without thought, are nonabiding, and are free of the marks of practice, and who, since they have perfected their former vows and knowledge, appear in various forms in many hundreds of millions of buddha fields yet are immovable from the dharmadhātu, who always teach the Dharma even though even the slightest real characteristic of dharmas does not exist, who make sentient beings thoroughly mature with four means of conversion even though there are no beings to be liberated, who purify all buddha fields even though they do not really observe purified buddha fields, who always are mindful of the buddhas even when not observing their external manifestation, who wander in buddha fields even though they are not separated from the dharmadhātu, this is called the effortless wisdom of the bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འདི་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་པའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱས་ཀྱང་གང་བྱས་པ་དེ་དག་ལ་མངོན་པར་ཞེན་པ་ཡང་མེད་དོ། །
en: Bodhisattvas, because they possess this sort of wisdom, fulfill the desires of all sentient beings, but they have no attachment to what they have done.”

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་རྩོལ་བ་མེད་པའི་ཡེ་ཤེས་འདི་བསྟན་པ་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་ཏོ། །
en: At that time, when the Bhagavān explained effortless wisdom, this three-thousandfold universe shook in six ways.

source: བརྒྱ་བྱིན་ལྷའི་དབང་པོ་ཡང་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་བཅས་པར་སྟེང་གི་བར་སྣང་ལས་མེ་ཏོག་མན་དཱ་ར་བ་དང་། ཨུད་པ་ལ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དང་། པུན་ད་རི་ཀ་དང་། ཙན་དན་གྱི་ཕྱེ་མའི་ཆར་མངོན་པར་ཕབ་སྟེ། བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ཏོ། །
en: Indra, lord of the gods, together with the gods of the Heaven of the Thirty-Three, released a rain of coral tree flowers, blue lotus flowers, red lotus flowers, padma lotus flowers, white lotus flowers, and sandalwood powder and scattered it over the Bhagavān.

source: ལྷའི་རྔ་རྣམས་ཀྱང་རང་སྒྲ་བྱུང་བར་གྱུར་ཏོ། །
en: Heavenly drums also sounded.

source: ངོ་མཚར་རྨད་དུ་བྱུང་བའི་སྣང་བ་ཆེན་པོས་ཀྱང་ཀུན་ཏུ་སྣང་བར་བྱས་ཏེ། སེམས་ཅན་གང་ལ་རེག་པར་གྱུར་པ་དེའི་ལུས་ཀྱང་ཤིན་ཏུ་བསིལ་བར་གྱུར་ཏོ། །
en: Amazing and wondrous lights illuminated everything, and the body of any sentient being who encountered this was completely soothed.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་གློག་ཐོབ་ལ་བཀའ་སྩལ་པ། གློག་ཐོབ་འདས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་གནས་འདིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་གསུངས་སོ། །
en: The Bhagavān then said to the bodhisattva Vidyutprāpta, “Vidyutprāpta, the tathāgatas, arhats, perfectly enlightened ones of the past also spoke this kind of Dharma discourse in this place.

source: མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བའི་ཚེ་ཡང་གནས་འདིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་གསུང་བར་འགྱུར་རོ། །
en: Future tathāgatas, when they arise, will also speak this kind of Dharma discourse in this place.

source: འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པ་དག་ན་ད་ལྟར་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྒྱུན་མི་འཆད་པར་མཛད་པའི་ཕྱིར་འོད་ཟེར་ཆེན་པོ་འགྱེད་པར་མཛད་དོ། །
en: The tathāgatas now living in unlimited, innumerable world systems, in order to perform this Dharma discourse without interruption, give off a great light.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Then the venerable Ānanda rose from his seat, removed his robe from one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས། །
en: He joined his palms in the direction of the Bhagavān and asked the Bhagavān, “What is the title of this Dharma discourse?

source: བདག་གིས་ཇི་ལྟར་ཡོངས་སུ་གཟུང་བར་བགྱི།
en: How should I remember it?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་མི་ཟད་པའི་གཏེར་བསྟན་པ་ཞེས་བྱའོ། །
en: The Bhagavān said, “Ānanda, this Dharma discourse is called The Teaching of Inexhaustible Treasures.

source: ཆོས་ཐམས་ཅད་དབྱེར་མེད་པའི་མཚན་ཉིད་བསྟན་པ་ཞེས་ཀྱང་བྱ་སྟེ།
en: It is also called The Teaching of the Undifferentiated Nature of All Dharmas.

source: ཁྱོད་ཀྱིས་དེ་ལྟར་མིང་ཡོངས་སུ་གཟུང་བར་བྱའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་གློག་ཐོབ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་།
en: You should remember it with these titles.”

source: འཁོར་བཞི་པོ་རྣམས་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་ཡི་རངས་ཏེ་མངོན་པར་བསྟོད་དོ།། །།
en: After the Bhagavān said this, the bodhisattva Vidyutprāpta, the venerable Ānanda, the four assemblies, and all the worlds, including the gods, humans, asuras, and gandharvas, were delighted by what the Bhagavān had said and praised it greatly.

source: འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས་མི་ཟད་པའི་གཏེར་བསྟན་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་འདུས་པ་ཉི་ཤུ་པ་རྫོགས་སོ།། །།
en: The twentieth chapter, the chapter of the teaching of inexhaustible treasures, from the hundred-thousand-chapter Dharma discourse “Ārya Mahā­ratnakūṭa,” is completed.
